// Унарные операторы

//a++
//+a Конвертировать строку в число
//new Object()
//delete
//typeof 


// Бинарные операторы

// a =5 
// a + b
// a += 5 Берем а, прибавляем 5, новое присваиваем а
// a === b сравнение и типа и значения
// a && b


// Инфиксная запись - когда оператор между операндами
// a = true

// Префиксная запись, когда операнда после оператора
// ++a
// delete obj.a

//Постфиксная запись, оператор за операндом
//a++
// myFunction()     - () это оператор вызова функции



////////////////////////////////////////////
// const a = Object();
// console.log(Boolean(!!a))


////////////////////////////////////////////
//     // Оператор ... разделения обьъекта на свойства
// const button = {
//     width: 200,
//     text: 'Buy'
// }

// const redButton = {
//     ...button,
//     color: 'red'
// }

// //РАНЬШЕ МЫ ПИСАЛИ ЭТО ОПРЕАТОР ВОТ ТАК
// // const redButton = {... button}
// // redButton.color = 'red',


// console.table(redButton)


